In [1]:
# The initial set of baby names and birth rates
names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]

In [2]:
birthdata = list(zip(names,births))

In [8]:
import numpy as np
import pandas as pd

df = pd.DataFrame(data = birthdata, columns=['names','births'])

In [9]:
df

     names  births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [21]:
import os

cwd = os.getcwd()
df.to_csv('pratice1CSV', index=False, header=True)

In [20]:
os.remove('pratice1CSV')

In [22]:
df = pd.read_csv('pratice1CSV')

In [24]:
df

   Unnamed: 0    names  births
0           0      Bob     968
1           1  Jessica     155
2           2     Mary      77
3           3     John     578
4           4      Mel     973

In [39]:
df.dtypes

Unnamed: 0     int64
names         object
births         int64
dtype: object

In [40]:
df

   Unnamed: 0    names  births
0           0      Bob     968
1           1  Jessica     155
2           2     Mary      77
3           3     John     578
4           4      Mel     973

In [41]:
df.sort_values(['births'], ascending= True)

   Unnamed: 0    names  births
2           2     Mary      77
1           1  Jessica     155
3           3     John     578
0           0      Bob     968
4           4      Mel     973

In [46]:
df['names'][df['births'] == df['births'].max()]

4    Mel
Name: names, dtype: object

In [49]:
df.columns

Index(['Unnamed: 0', 'names', 'births'], dtype='object')